<html>
<head>
<title>TIC - TAC - TOE</title>
</head>
<body background="bg.gif">

<SCRIPT LANGUAGE="JavaScript">

<!-- 


var x = "x.jpg";   // Сетирање на слика за "X"
var o = "o.jpg";   // Сетирање на слика за точка "0"
var prazno = "prazno.jpg"; //Поставување на слика за непотполнето поле 

// Иницијализација на променливите кои се користат 

var pause = 0;   
var proverka = 0; //Проверка за подебеда на компјутер=2, играч=1, нерешено=3
 
var a = 0;  // Променлива "a" за полето на позиција 11
var b = 0;  // Променлива "b" за полето на позиција 12
var c = 0;  // Променлива "c" за полето на позиција 12
var d = 0;  // Променлива "d" за полето на позиција 21
var e = 0;  // Променлива "e" за полето на позиција 22
var f = 0;  // Променлива "f" за полето на позиција 23
var g = 0;  // Променлива "g" за полето на позиција 31
var h = 0;  // Променлива "h" за полето на позиција 32
var i = 0;  // Променлива "i" за полето на позиција 33

var pomosna=""; // Помошна променлива која покажува кое поле е празно а прима вредности од "A-I"
var vnes = 0;  // 
var provPole = 0;
var izbor=9;

var randomBroj = 0;
var slIzborCom = 0;  // Променлива за избор на поле од страна на компјутерот
var redosled = 0;    // Променлива за ресетирање, ако е 2 прв почнува да игра компјутерот, инаку играчот

var rezIgrac = 0;  // Променлива која го чува резултатот на играчот
var rezCom = 0;  //Променливца која го чува резултатот на компјутерот
var rezNer = 0;  // Променлива која брои колку нерешени резултати имало

// Функкција "pomos" која се повикува со клик на линкот Помош и јавува порака на корисникот во pop-up прозорец
function pomos() {

alert("Доредојдовте на Tic-Tac-Toe играта! Вие играте со знак X додека компјутерот игра со знак O.  Одберете поле каде што ќе ставите X со клик врз полето. Не можете да го одберете веќе искористеното поле. Еден од двата играчи кој ќе добие три исти полиња се смета за победник на играта. Со среќа!!! :)")

}


// Функција "logicOne" која преку проверка на вредностите на променливата "proverka" утврдува дали има победник и кој е - играчот или компјутерот

// proverka=1 , победа за играчот (X)
// proverka=2, победа за компјутерот (0)
// proverka=3, нерешен резултат

function triIsti() {

//Сите можни комбинации за победа на играчот 
if ((a==1)&&(b==1)&&(c==1)) proverka=1; // Првиот ред е со три икса
if ((a==1)&&(d==1)&&(g==1)) proverka=1; // Првата колона е со три исти
if ((a==1)&&(e==1)&&(i==1)) proverka=1; // Дијагонала од лево кон десно
if ((b==1)&&(e==1)&&(h==1)) proverka=1;  // Втората колона е со три икса
if ((d==1)&&(e==1)&&(f==1)) proverka=1;  // Вториот ред е со три икса
if ((g==1)&&(h==1)&&(i==1)) proverka=1;  // Третиот ред е со три икса
if ((c==1)&&(f==1)&&(i==1)) proverka=1;  // Третата колона е со три икса
if ((g==1)&&(e==1)&&(c==1)) proverka=1;  // Дијагоналата од десно кон лево е со три икса

// Сите можни комбинации за победа на компјутерот
if ((a==2)&&(b==2)&&(c==2)) proverka=2;  // Првиот ред е со три точки
if ((a==2)&&(d==2)&&(g==2)) proverka=2;  // Првата колона е со три точки
if ((a==2)&&(e==2)&&(i==2)) proverka=2;  // Дијагонала од лево кон точки
if ((b==2)&&(e==2)&&(h==2)) proverka=2; // Втората колона е со три точки
if ((d==2)&&(e==2)&&(f==2)) proverka=2;  // Вториот ред е со три точки
if ((g==2)&&(h==2)&&(i==2)) proverka=2;  // Третиот ред е со три точки
if ((c==2)&&(f==2)&&(i==2)) proverka=2;  // Третата колона е со три точки
if ((g==2)&&(e==2)&&(c==2)) proverka=2;  // Дијагоналата од десно кон лево е со три точки

// Ако сите полиља се потполнети а вредноста на "proverka" не се променила во 1 - 2, односно е 0, се поставува на 3- нерешено
if ((a != 0)&&(b != 0)&&(c != 0)&&(d != 0)&&(e != 0)&&(f != 0)&&(g != 0)&&(h != 0)&&(i != 0)&&(proverka == 0)) proverka = 3;

} 


//Функција "dveIstiCom" која врши проверка за тоа кое поле е слободно во текот на играта а има потполнето две исти од компјутерот - т.е можност за победа на компјутерот
function dveIstiCom() {

if ((a==2)&&(b==2)&&(c== 0)&&(pomosna=="")) pomosna="C";  // Слободно е "C" темп ја поставува на C, a i b се потполнети од компјутерот
if ((a==2)&&(b== 0)&&(c==2)&&(pomosna=="")) pomosna="B";  // Слободно е "B" темп ја поставува на B, a i c се потполнети од компјутерот
if ((a== 0)&&(b==2)&&(c==2)&&(pomosna=="")) pomosna="A";  // Слободно е "A" темп ја поставува на A, b i c се потполнети од компјутерот
if ((a==2)&&(d==2)&&(g== 0)&&(pomosna=="")) pomosna="G";  // Слободно е "G" темп ја поставува на G, a i d се потполнети од компјутерот
if ((a==2)&&(d== 0)&&(g==2)&&(pomosna=="")) pomosna="D";  // Слободно е "D" темп ја поставува на D, a i g се потполнети од компјутерот
if ((a== 0)&&(d==2)&&(g==2)&&(pomosna=="")) pomosna="A";  // Слободно е "A" темп ја поставува на A, d i g се потполнети од компјутерот
if ((a==2)&&(e==2)&&(i== 0)&&(pomosna=="")) pomosna="I";  // Слободно е "I" темп ја поставува на I, a i e се потполнети од компјутерот
if ((a==2)&&(e== 0)&&(i==2)&&(pomosna=="")) pomosna="E";  // Слободно е "E" темп ја поставува на E, a i i се потполнети од компјутерот
if ((a== 0)&&(e==2)&&(i==2)&&(pomosna=="")) pomosna="A";  // Слободно е "A" темп ја поставува на E, e i i се потполнети од компјутерот
if ((b==2)&&(e==2)&&(h== 0)&&(pomosna=="")) pomosna="H";  // Слободно е "h" темп ја поставува на H, b i e се потполнети од компјутерот
if ((b==2)&&(e== 0)&&(h==2)&&(pomosna=="")) pomosna="E";  // Слободно е "e" темп ја поставува на E, b i h се потполнети од компјутерот
if ((b== 0)&&(e==2)&&(h==2)&&(pomosna=="")) pomosna="B";  // Слободно е "b" темп ја поставува на B, e i h се потполнети од компјутерот
if ((d==2)&&(e==2)&&(f== 0)&&(pomosna=="")) pomosna="F";  // Слободно е "f" темп ја поставува на F, d i e се потполнети од компјутерот
if ((d==2)&&(e== 0)&&(f==2)&&(pomosna=="")) pomosna="E";  // Слободно е "e" темп ја поставува на E, d i f се потполнети од компјутерот
if ((d== 0)&&(e==2)&&(f==2)&&(pomosna=="")) pomosna="D";  // Слободно е "d" темп ја поставува на D, e i f се потполнети од компјутерот
if ((g==2)&&(h==2)&&(i== 0)&&(pomosna=="")) pomosna="I";  // Слободно е "i" темп ја поставува на I, g i h се потполнети од компјутерот
if ((g==2)&&(h== 0)&&(i==2)&&(pomosna=="")) pomosna="H";  // Слободно е "h" темп ја поставува на H, g i i се потполнети од компјутерот
if ((g== 0)&&(h==2)&&(i==2)&&(pomosna=="")) pomosna="G";  // Слободно е "g" темп ја поставува на G, h i i се потполнети од компјутерот
if ((c==2)&&(f==2)&&(i== 0)&&(pomosna=="")) pomosna="I";  // Слободно е "i" темп ја поставува на I, c i f се потполнети од компјутерот
if ((c==2)&&(f== 0)&&(i==2)&&(pomosna=="")) pomosna="F";  // Слободно е "f" темп ја поставува на F, c i i се потполнети од компјутерот
if ((c== 0)&&(f==2)&&(i==2)&&(pomosna=="")) pomosna="C";  // Слободно е "c" темп ја поставува на C, f i i се потполнети од компјутерот
if ((g==2)&&(e==2)&&(c== 0)&&(pomosna=="")) pomosna="C";  // Слободно е "c" темп ја поставува на C, g i e се потполнети од компјутерот
if ((g==2)&&(e== 0)&&(c==2)&&(pomosna=="")) pomosna="E";  // Слободно е "e" темп ја поставува на E, g i c се потполнети од компјутерот
if ((g== 0)&&(e==2)&&(c==2)&&(pomosna=="")) pomosna="G";  // Слободно е "g" темп ја поставува на G, e i c се потполнети од компјутерот
}


//Функција "logicThree" која врши проверка за тоа кое поле е слободно во текот на играта 
//а има потполнето две исти од страна на играчот - т.е можност за победа на играчот


function dveIstiIgr() {

if ((a==1)&&(b==1)&&(c==0)&&(pomosna=="")) pomosna="C";  // Слободно е "C" темп ја поставува на C, a i b се потполнети од играчот
if ((a==1)&&(b==0)&&(c==1)&&(pomosna=="")) pomosna="B";  // Слободно е "B" темп ја поставува на B, a i c се потполнети од играчот
if ((a==0)&&(b==1)&&(c==1)&&(pomosna=="")) pomosna="A";  // Слободно е "A" темп ја поставува на A, b i c се потполнети од играчот
if ((a==1)&&(d==1)&&(g==0)&&(pomosna=="")) pomosna="G";  // Слободно е "G" темп ја поставува на G, a i d се потполнети од играчот
if ((a==1)&&(d==0)&&(g==1)&&(pomosna=="")) pomosna="D";  // Слободно е "D" темп ја поставува на D, a i g се потполнети од играчот
if ((a==0)&&(d==1)&&(g==1)&&(pomosna=="")) pomosna="A";  // Слободно е "A" темп ја поставува на A, d i g се потполнети од играчот
if ((a==1)&&(e==1)&&(i==0)&&(pomosna=="")) pomosna="I";  // Слободно е "I" темп ја поставува на I, a i e се потполнети од играчот
if ((a==1)&&(e==0)&&(i==1)&&(pomosna=="")) pomosna="E";  // Слободно е "E" темп ја поставува на E, a i i се потполнети од играчот
if ((a==0)&&(e==1)&&(i==1)&&(pomosna=="")) pomosna="A";  // Слободно е "A" темп ја поставува на E, e i i се потполнети од играчот
if ((b==1)&&(e==1)&&(h==0)&&(pomosna=="")) pomosna="H";  // Слободно е "h" темп ја поставува на H, b i e се потполнети од играчот
if ((b==1)&&(e==0)&&(h==1)&&(pomosna=="")) pomosna="E";  // Слободно е "e" темп ја поставува на E, b i h се потполнети од играчот
if ((b==0)&&(e==1)&&(h==1)&&(pomosna=="")) pomosna="B";  // Слободно е "b" темп ја поставува на B, e i h се потполнети од играчот
if ((d==1)&&(e==1)&&(f==0)&&(pomosna=="")) pomosna="F";  // Слободно е "f" темп ја поставува на F, d i e се потполнети од играчот
if ((d==1)&&(e==0)&&(f==1)&&(pomosna=="")) pomosna="E";  // Слободно е "e" темп ја поставува на E, d i f се потполнети од играчот
if ((d==0)&&(e==1)&&(f==1)&&(pomosna=="")) pomosna="D";  // Слободно е "d" темп ја поставува на D, e i f се потполнети од играчот
if ((g==1)&&(h==1)&&(i==0)&&(pomosna=="")) pomosna="I";  // Слободно е "i" темп ја поставува на I, g i h се потполнети од играчот
if ((g==1)&&(h==0)&&(i==1)&&(pomosna=="")) pomosna="H";  // Слободно е "h" темп ја поставува на H, g i i се потполнети од играчот
if ((g==0)&&(h==1)&&(i==1)&&(pomosna=="")) pomosna="G";  // Слободно е "g" темп ја поставува на G, h i i се потполнети од играчот
if ((c==1)&&(f==1)&&(i==0)&&(pomosna=="")) pomosna="I";  // Слободно е "i" темп ја поставува на I, c i f се потполнети од играчот
if ((c==1)&&(f==0)&&(i==1)&&(pomosna=="")) pomosna="F";  // Слободно е "f" темп ја поставува на F, c i i се потполнети од играчот
if ((c==0)&&(f==1)&&(i==1)&&(pomosna=="")) pomosna="C";  // Слободно е "c" темп ја поставува на C, f i i се потполнети од играчот
if ((g==1)&&(e==1)&&(c==0)&&(pomosna=="")) pomosna="C";  // Слободно е "c" темп ја поставува на C, g i e се потполнети од играчот
if ((g==1)&&(e==0)&&(c==1)&&(pomosna=="")) pomosna="E";  // Слободно е "e" темп ја поставува на E, g i c се потполнети од играчот
if ((g==0)&&(e==1)&&(c==1)&&(pomosna=="")) pomosna="G";  // Слободно е "g" темп ја поставува на G, e i c се потполнети од играчот 
}

// Функција за чисрење на полињата во случај на завршеток на играта
function isprazniRez() {

document.game.you.value="0"; 
document.game.computer.value="0";
document.game.ties.value="0";
}

// Функција за проверка на празните полиња
function proveriSlob() {

// Ако полето "A" е празно 
if ((pomosna=="A")&&(a==0)) {   

vnes=1;                        

if (provPole==0) a=1;             // Се проверува дали играчот има внесено "X" во полето "A" 
if (provPole==1) a=2;             // Се проверува дали копјутерот има внесено "0" во полето "A" 

}

// Ако полето "Б" е празно 
if ((pomosna=="B")&&(b==0)) {  

vnes=1;

if (provPole==0) b=1;           // Се проверува дали играчот има внесено "X" во полето "B"
if (provPole==1) b=2;           // Се проверува дали копјутерот има внесено "0" во полето "B"

}

// Ако полето "C" е празно 
if ((pomosna=="C")&&(c==0)) {

vnes=1;

if (provPole==0) c=1;         // Се проверува дали играчот има внесено "X" во полето "C"
if (provPole==1) c=2;         // Се проверува дали играчот има внесено "X" во полето "C"

 
}

// Ако полето "D" е празно 
if ((pomosna=="D")&&(d==0)) {

vnes=1;

if (provPole==0) d=1;         // Се проверува дали играчот има внесено "X" во полето "D"
if (provPole==1) d=2;         // Се проверува дали играчот има внесено "X" во полето "D"


}// Ако полето "E" е празно 
if ((pomosna=="E")&&(e==0)) {

vnes=1;

if (provPole==0) e=1;       // Се проверува дали играчот има внесено "X" во полето "E"
if (provPole==1) e=2;       // Се проверува дали играчот има внесено "X" во полето "E"


}

// Ако полето "F" е празно 
if ((pomosna=="F")&&(f==0)) {

vnes=1

if (provPole==0) f=1;        // Се проверува дали играчот има внесено "X" во полето "F"
if (provPole==1) f=2;        // Се проверува дали играчот има внесено "X" во полето "F"


}

// Ако полето "G" е празно 
if ((pomosna=="G")&&(g==0)) {

vnes=1

if (provPole==0) g=1;      // Се проверува дали играчот има внесено "X" во полето "G"
if (provPole==1) g=2;      // Се проверува дали играчот има внесено "X" во полето "G"


}

// Ако полето "H" е празно 
if ((pomosna=="H")&&(h==0)) {

vnes=1;

if (provPole==0) h=1;     // Се проверува дали играчот има внесено "X" во полето "H"
if (provPole==1) h=2;     // Се проверува дали играчот има внесено "X" во полето "H"


}

// Ако полето "I" е празно 
if ((pomosna=="I")&&(i==0)) {

vnes=1;

if (provPole==0) i=1;     // Се проверува дали играчот има внесено "X" во полето "I"
if (provPole==1) i=2;     // Се проверува дали играчот има внесено "X" во полето "I"


}

}

// Функција за избор на играчот
function izborIgrac(chName) {

pause = 0;  
if (proverka!=0) kraj();               // Ако сите полиња се потполнети играта завршува
if (proverka==0) {                      // Ако сите полиња се празни 
provPole = 0;                            // Полето резервирано за внос од компјутерот се иницијализира на 0 - е празно
vnes = 0;                            // Полето како слободно за внесување од страна на играчот
pomosna=chName;                       // Во полето внесува играчот
proveriSlob();                      // Се повикува proveriSlob();  
if (vnes==1) {                       //Ако играчот кликне во празно поле

document.images[chName].src = x;   // Се вчитува слика за "X"

}

if (vnes==0)iskoristenoPole();                 // Ако играчот кликне на поле кое е зафатено се повикува iskoristenoPole() со порака дека полето е зафатено
izvestuvanje();                         // Се повикува izvestuvanje() за да се провери кој е победник (компјутерот, играчот или е нерешено)

if ((proverka==0)&&(pause==0)) izborKompjuter();  // Ако има слободни полиња компјутерот има право на избор се повикува izborKompjuter()

   }

}

// Ако се кликне на искористено поле се испишува порака
function iskoristenoPole() {

alert("Ова поле е веќе искористено. Ве молиме одберете друго поле кое е празно.")

pause=1;

}

// Функција за избор на компјутерот

function izborKompjuter() {

pomosna=""; 

vnes = 0; // Играчот не внесува
 
provPole=1;   // Компјутерот избира

dveIstiCom();

dveIstiIgr();

proveriSlob();

while(vnes==0) {  // Се додека е на потег компјутерот

randomBroj=Math.random()   // Се користи рандом функција за избор на празно поле

slIzborCom=Math.round((izbor-1)*randomBroj)+1;  // Избор на соседно поле по случаен избор

if (slIzborCom==1) pomosna="A";  // Компјутерот избрал 1
if (slIzborCom==2) pomosna="B";  // Компјутерот избрал 2
if (slIzborCom==3) pomosna="C";  // Компјутерот избрал 3
if (slIzborCom==4) pomosna="D";  // Компјутерот избрал 4
if (slIzborCom==5) pomosna="E";  // Компјутерот избрал 5
if (slIzborCom==6) pomosna="F";  // Компјутерот избрал 6
if (slIzborCom==7) pomosna="G";  // Компјутерот избрал 7
if (slIzborCom==8) pomosna="H";  // Компјутерот избрал 8
if (slIzborCom==9) pomosna="I";  // Компјутерот избрал 9

proveriSlob();

}

document.images[pomosna].src= o; // Се поставува слика за "0" на местото кај што е избрано поле

izvestuvanje();  // Се повикува izvestuvanje() за да се провери кој е победник (компјутерот, играчот или е нерешено)

}

// Функција која дава порака за крај
function kraj() {  

alert("Играта заврши. Доколку сакате да играте одново кликнете на копчето “Играј повторно!“.")

}

// Функција за процесирање
function izvestuvanje() {

triIsti(); // Се повикува triIsti() за да се дознае каде има победник, и колку е вредноста на променливата "proverka"

if (proverka==1){ alert("Честитки, Вие сте победникот!"); rezIgrac++; }  // Победа за играч - променливата rezIgrac- РЕЗУЛТАТОТ ЗА ИГРАЧОТ се зголемува за 1 

if (proverka==2){ alert(" Компјутерот победи!"); rezCom++; }           // Победа за компјутерот - променливата rezCom - РЕЗУЛТАТОТ ЗА КОМПЈУТЕРОТ се зголемува за 1 

if (proverka==3){ alert("Играта заврши со нерешен резултат."); rezNer++; }   // Нерешено = Променливата rezNer - се зголемува за еден, се бројатр нерешените резултати

if (proverka!=0) {  // Ако сите полиња се потполнети 

document.game.you.value = rezIgrac;  

document.game.computer.value = rezCom;

document.game.ties.value = rezNer;

   }

}

// Функција која се повикува со клик на копчето за Играње
function igrajPak() {

//Ако сите полиња се празни
if (proverka==0) { 

if(confirm("Играта ќе започне од старт и резултатот ќе биде ресетириран. OK?")) reset();
// Ако играчот се согласил. се повикува функцијата "reset" која сите вредности ги поставува на 0

}

if (proverka>0) reset(); // Ако некои од нив не се нули, повторно се вика функцијата "reset"

}

// Функција за чистење на сите променливи и постваување на нивните почетни вредности - нули
function reset() {

proverka = 0;

a = 0;
b = 0;
c = 0;
d = 0;
e = 0;
f = 0;
g = 0;
h = 0;
i = 0;

pomosna="";

vnes = 0;

provPole = 0;

izbor=9;

randomBroj = 0;

slIzborCom = 0; 
// Се враќаат почетните слики

document.images.A.src= prazno;
document.images.B.src= prazno;
document.images.C.src= prazno;
document.images.D.src= prazno;
document.images.E.src= prazno;
document.images.F.src= prazno;
document.images.G.src= prazno;
document.images.H.src= prazno;
document.images.I.src= prazno;


if (redosled==0) { redosled=2; izborKompjuter(); } // Доколку сите полиња се ресетирани, прв почнува компјутерот, а на следното ресетирање почнува играчот

redosled--; // Вредноста на т се менува и редоследот на игра се менува

}



//   -->

</script>
<div align="center">
<form name=game>

<table > 

<td >
<tr><img src="title.png"></tr>  

<tr><div align="center"><?php require_once('meni.php'); ?></div></tr>   
<table border="0">

<tr>

<td><a href="javascript:izborIgrac('A')"><img src="prazno.jpg" border="0" height="180" width="180" name="A" alt="Top-Left"></a></td> 

<td><a href="javascript:izborIgrac('B')"><img src="prazno.jpg" border="0" height="180" width="180" name="B" alt="Top-Center"></a></td>

<td><a href="javascript:izborIgrac('C')"><img src="prazno.jpg" border="0" height="180" width="180" name="C" alt="Top-Right"></a></td>
<td><a href="javascript:igrajPak()"><img src="play.png"></a></td> 

</tr>

<tr>

<td><a href="javascript:izborIgrac('D')"><img src="prazno.jpg" border="0" height="180" width="180" name="D" alt="Middle-Left"></a></td>

<td><a href="javascript:izborIgrac('E')"><img src="prazno.jpg" border="0" height="180" width="180" name="E" alt="Middle-Center"></a></td>

<td><a href="javascript:izborIgrac('F')"><img src="prazno.jpg" border="0" height="180" width="180" name="F" alt="Middle-Right"></a></td>
<td>Вашиот резултат:</br><input type="text" size="5" name="you"></br> 
Резултатот на компјутерот е:</br><input type="text" size="5" name="computer"></br>
Нерешено:</br><input type="text" size="5" name="ties">
</td>

</tr>

<tr>

<td><a href="javascript:izborIgrac('G')"><img src="prazno.jpg" border="0" height="180" width="180" name="G" alt="Bottom-Left"></a></td>

<td><a href="javascript:izborIgrac('H')"><img src="prazno.jpg" border="0" height="180" width="180" name="H" alt="Bottom-Center"></a></td>

<td><a href="javascript:izborIgrac('I')"><img src="prazno.jpg" border="0" height="180" width="180" name="I" alt="Bottom-Right"></a></td>
<td><a href="javascript:pomos()"><figure><img src="pomos.png"/></a><figcaption>Помош!</figcaption><figure></td>

</tr><tr>

<br /><br />



</tr>

</table>

</td>

<td>

<table>




</table>

</td>

</table>

</form>
</div>
<div align="center"><?php require_once('footer.php'); ?></div> 
</body>
</html>